{
    "UC1zZE_kJ8rQHgLTVfobLi_g": {
        "channel_create_date": "2010-01-04T03:15:19.000Z", 
        "channel_title": "The King of Random", 
        "subscriber_count": 11231265, 
        "all_playlists_titles": "King Of Random Rewind Slime Time Ice, Ice Baby Molten Mayhem Things that Go BOOM! TKOR Goes to the Movies Gaming Inspired Projects Desktop Weapons Make It At Home Weirdest Things Done with Candy How Does It React in a Vacuum Chamber? Best How To and DIYs Popular Experiments Liquid Nitrogen Experiments Extras Kid Friendly Content - YouTube Kids Random Happens You Asked For It! The Kings Court Build And Launch A Rocket (From The Ground Up) Experiments Mad Science Life Hacks & Compliations Mind Bender Trivia 10 Insane Party Tricks for 2014 - YouTube Mega-Collaboration Favorite Projects Mind Blowing Science Experiments TimeBenders Favorites Fancy Napkins Just For Fun Microwave Modifications Collaborations Random Weekend Projects Quick Clips Survival Techniques ", 
        "all_playlists_desc": "        Cool things you can make using common household materials. Crazy experiments with gummy candy, chocolate, and homemade silicone molds. These King of Random projects range from lego gummy candy to gummy chickens, chocolate hearts, Chocolate LEGO Marios, Thumb suckers, edible Pokeballs, gummy lobster tails, and even Heart of Te Fiti glow in the dark hard candy! The results are pretty \"sweet\". These King of Random science experiments and vacuum chamber experiments are demonstrated in a DIY homemade cookie jar vacuum chamber.  From slime, to silicone, to liquid nitrogen, dry ice and more, watch what happens when we flip on the vacuum pump, and suck the pressure out.                 Time Benders are super slow motion clips of random events and experiments.  Fold napkins into amazing works of art, that will dazzle your guests, and make your holiday dinners extra stunning!  They're easier than you might think.\r\n\r\nWARNING:  Dinner guests may become overly intimidated by your amazing napkin folding skills.  Use of video content is at own risk. They're Not Weekend Projects.  Not Quick Clips Either.  These are Just For Fun! Hacks and projects made with parts from microwave ovens Collaboration videos with other YouTubers Random Weekend Projects \"Quick Clips\" of random experiments in a minute or less. Tips and tricks you'll hopefully never have to use, but good to know in case you do. ", 
        "channel_desc": "We make videos dedicated to exploring life through all kinds of life hacks, experiments, and random weekend projects.\n\nThere is excitement found in discovering the unknown, so join us and let’s build something great together. \n\nFTC Disclaimer: We earn a % of sales made through Amazon Affiliate links", 
        "all_videos_desc": null, 
        "categories": [
            "https://en.wikipedia.org/wiki/Lifestyle_(sociology)", 
            "https://en.wikipedia.org/wiki/Food"
        ], 
        "view_count": 2306434906, 
        "video_count": 908, 
        "channel_id": "UC1zZE_kJ8rQHgLTVfobLi_g", 
        "image_url": "https://yt3.ggpht.com/a/AGF-l7903sDCe8kkmFFSKhznQOho6fTemCuw_f3zHg=s88-mo-c-c0xffffffff-rj-k-no", 
        "channel_url": "https://www.youtube.com/channel/UC1zZE_kJ8rQHgLTVfobLi_g", 
        "all_videos_titles": null
    }
}